# Pandas Library

In [2]:
# importing pandas
import pandas as pd

In [3]:
# Series : create and operation

In [4]:
# create an empty series
series = pd.Series()

C:\Users\divay\AppData\Local\Temp/ipykernel_12172/2191239167.py:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  series = pd.Series()

In [5]:
print(series)

Series([], dtype: float64)

In [6]:
# create a series from an array
import numpy as np

In [7]:
data = np.array(['g', 'e', 's', 'd', 'm'])

In [8]:
series = pd.Series(data)

In [9]:
print(series)

0    g
1    e
2    s
3    d
4    m
dtype: object

In [10]:
# create a series from a dictionary
dict = { 'divya' : 10, 'aishwarya' : 10, 'pandas' : 30}

In [11]:
series1 = pd.Series(dict
                   )

In [12]:
print(series1)

divya        10
aishwarya    10
pandas       30
dtype: int64

In [13]:
# create a series form a scalar value
series2 = pd.Series(10, index = [0, 1, 2, 3, 4, 5])

In [14]:
print(series2)

0    10
1    10
2    10
3    10
4    10
5    10
dtype: int64

In [15]:
data = np.array(['g', 'e', 'e', 'k', 's'])

In [16]:
series3 = pd.Series(data, index = [10, 11, 12, 13, 14])

In [17]:
print(series3)

10    g
11    e
12    e
13    k
14    s
dtype: object

In [18]:
# creating series using range function
series4 = pd.Series(range(10))

In [19]:
print(series4)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [20]:
series5 = pd.Series(range(1, 20, 3), index = [x for x in 'abcdefg'])

In [21]:
print(series5)

a     1
b     4
c     7
d    10
e    13
f    16
g    19
dtype: int64

In [22]:
# top 5 rows will display 
series5.head()

a     1
b     4
c     7
d    10
e    13
dtype: int64

In [23]:
# bottom 5 rows will display
series5.tail()

c     7
d    10
e    13
f    16
g    19
dtype: int64

In [24]:
# total number of non-empty values
series5.count()

7

In [25]:
# maximum value in series
series5.max()

19

In [26]:
#minimum value in series
series5.min()

1

In [27]:
data = np.array(['g', 'e', 's', 'd', 'm'])

In [28]:
series = pd.Series(data)

In [29]:
print(series)

0    g
1    e
2    s
3    d
4    m
dtype: object

In [30]:
# accessing the item by index
print(series[3])

d

In [31]:
s = pd.Series([1, 3, 5, 6, 8])
print(s)

0    1
1    3
2    5
3    6
4    8
dtype: int64

In [32]:
# indexing/selection : accessing data from series with position
print(s[0])

1

In [33]:
print(s[1:3])

1    3
2    5
dtype: int64

In [34]:
print(s[[0, 2, 4]])

0    1
2    5
4    8
dtype: int64

In [35]:
# assignment : you can modify the series in place by assigning to the indexer
s[0] = 999

In [36]:
print(s)

0    999
1      3
2      5
3      6
4      8
dtype: int64

In [37]:
# deletion : deleting an item from a series.
# deleting an item at index 0
s = s.drop([0])

In [38]:
print(s)

1    3
2    5
3    6
4    8
dtype: int64

In [39]:
# mathematical operations

In [40]:
# adding
s = s+2

In [41]:
print(s)

1     5
2     7
3     8
4    10
dtype: int64

In [42]:
# multiply
s = s * 3

In [43]:
print(s)

1    15
2    21
3    24
4    30
dtype: int64

In [44]:
# statistical operations

In [45]:
# sum of all values in series
print(s.sum())

90

In [46]:
# mean of all values in series
print(s.mean())

22.5

In [47]:
# Conversion : converting series into other data structure

In [48]:
# convert series to a list
list_s = s.tolist()

In [49]:
print(list_s)

[15, 21, 24, 30]

In [50]:
# converting series to a dectionary
dict_s = s.to_dict()

In [51]:
print(dict_s)

{1: 15, 2: 21, 3: 24, 4: 30}

In [52]:
# Sorting : you can sort a series by ites index or its values

In [53]:
# sorting by index
s = s.sort_index()

In [54]:
print(s)

1    15
2    21
3    24
4    30
dtype: int64

In [55]:
# sorting by values
s = s.sort_values()

In [56]:
print(s)

1    15
2    21
3    24
4    30
dtype: int64

In [57]:
# handling missing values

In [58]:
# detect missing data
print(s.isnull())

1    False
2    False
3    False
4    False
dtype: bool

# DataFrame

A DataFrame in Pandas is a two-dimensional, size-mutable, heterogeneous tabular data structure that allows for data manipulation in Python.

In [59]:
# create an Empty DataFrame in pandas
import pandas as pd

In [60]:
df = pd.DataFrame()

In [61]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [62]:
data = [1, 2, 3, 4, 5]
df['Roll No'] = data

In [63]:
print(df)

   Roll No
0        1
1        2
2        3
3        4
4        5

In [64]:
# creating data Frame from list
data_1 = ['Alex', 'Bob', 'Clarke']

In [65]:
df_1 = pd.DataFrame(data_1, columns = ['Name'])

In [66]:
print(df_1)

     Name
0    Alex
1     Bob
2  Clarke

In [67]:
data_2 = [['Alex', 10], ['Bob', 12], ['Clarke', 13]]

In [68]:
df_2 = pd.DataFrame(data_2, columns = ['Name', 'Age'])

In [69]:
print(df_2)

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [70]:
data = {'Name': ['John', 'Anna', 'Peter'], 'Age': [28, 24, 33]}
df = pd.DataFrame(data)

In [71]:
print(df)

    Name  Age
0   John   28
1   Anna   24
2  Peter   33

In [72]:
# Accessing data

In [73]:
# by column
df['Name']

0     John
1     Anna
2    Peter
Name: Name, dtype: object

In [74]:
# by row
df.loc[1]

Name    Anna
Age       24
Name: 1, dtype: object

In [75]:
df.iloc[1]

Name    Anna
Age       24
Name: 1, dtype: object

In [76]:
# modifying data

In [77]:
# to add new column
df['Gender'] = ['Male', 'Female', 'Male']

In [78]:
print(df)

    Name  Age  Gender
0   John   28    Male
1   Anna   24  Female
2  Peter   33    Male

In [79]:
# to modify an existing value
df.loc[0, 'Age'] = 25

In [80]:
print(df)

    Name  Age  Gender
0   John   25    Male
1   Anna   24  Female
2  Peter   33    Male

In [81]:
# Basic Statistical operations

In [82]:
# To calculate the mean age 
df['Age'].mean()

27.333333333333332

In [83]:
# to find the maximum age
df['Age'].max()

33

In [84]:
df['Age'].min()

24

In [85]:
# Create DataFrame from Dictionary 
details = { 'Name' : ['Ankit', 'Aishwarya', 'Shaurya', 'Shivangi'],
          'Age' : [23, 21, 22, 21], 
          'University' : ['BHU', 'JNU', 'DU', 'BHU']}

In [86]:
df = pd.DataFrame(details)

In [87]:
print(df)

        Name  Age University
0      Ankit   23        BHU
1  Aishwarya   21        JNU
2    Shaurya   22         DU
3   Shivangi   21        BHU

In [88]:
# constructing matrix using dataframe

In [89]:
inputmatrix = [[1, 2, 2],
              [1, 2, 0], 
              [1, 0, 2]]

In [90]:
inputmatrix1 = [[1, 0, 1], 
               [2, 1, 1], 
               [2, 1, 2]]

In [91]:
df_1 = pd.DataFrame(data = inputmatrix)

In [92]:
print(inputmatrix)

[[1, 2, 2], [1, 2, 0], [1, 0, 2]]

In [93]:
print(df_1)

   0  1  2
0  1  2  2
1  1  2  0
2  1  0  2

In [94]:
print(df_1.shape)

(3, 3)

In [95]:
df_2 = pd.DataFrame(data = inputmatrix1)

In [96]:
print(inputmatrix1)

[[1, 0, 1], [2, 1, 1], [2, 1, 2]]

In [97]:
print(df_2)

   0  1  2
0  1  0  1
1  2  1  1
2  2  1  2

In [98]:
print(df_2.shape)

(3, 3)

In [99]:
# loding csv files

In [100]:
data = pd.read_csv(r'D:\datasets\SQL Databases\music store data\employee.csv')

In [101]:
data

,employee_id,last_name,first_name,title,reports_to,levels,birthdate,hire_date,address,city,state,country,postal_code,phone,fax,email
0,1,Adams,Andrew,General Manager,9.0,L6,18-02-1962 00:00,14-08-2016 00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,L4,08-12-1958 00:00,01-05-2016 00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,L1,29-08-1973 00:00,01-04-2017 00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,L1,19-09-1947 00:00,03-05-2017 00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,L1,03-03-1965 00:00,17-10-2017 00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com
5,6,Mitchell,Michael,IT Manager,1.0,L3,01-07-1973 00:00,17-10-2016 00:00,5827 Bowness Road NW,Calgary,AB,Canada,T3B 0C5,+1 (403) 246-9887,+1 (403) 246-9899,michael@chinookcorp.com
6,7,King,Robert,IT Staff,6.0,L2,29-05-1970 00:00,02-01-2017 00:00,590 Columbia Boulevard West,Lethbridge,AB,Canada,T1K 5N8,+1 (403) 456-9986,+1 (403) 456-8485,robert@chinookcorp.com
7,8,Callahan,Laura,IT Staff,6.0,L2,09-01-1968 00:00,04-03-2017 00:00,923 7 ST NW,Lethbridge,AB,Canada,T1H 1Y8,+1 (403) 467-3351,+1 (403) 467-8772,laura@chinookcorp.com
8,9,Madan,Mohan,Senior General Manager,NaN,L7,26-01-1961 00:00,14-01-2016 00:00,1008 Vrinda Ave MT,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,madan.mohan@chinookcorp.com

In [102]:
# loding excel file

In [103]:
data_1 = pd.read_excel(r'C:\Users\divay\Documents\data 2.xlsx')

In [104]:
data_1

  First Name     Sex                       Email
0     Shelby    Male        elijah57@example.net
1    Phillip  Female       bethany14@example.com
2   Kristine    Male       bthompson@example.com
3    Yesenia    Male   kaitlinkaiser@example.com
4       Lori    Male  buchananmanuel@example.net

In [105]:
# head() : returns the top 5 rows

In [106]:
data.head()

,employee_id,last_name,first_name,title,reports_to,levels,birthdate,hire_date,address,city,state,country,postal_code,phone,fax,email
0,1,Adams,Andrew,General Manager,9.0,L6,18-02-1962 00:00,14-08-2016 00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,L4,08-12-1958 00:00,01-05-2016 00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,L1,29-08-1973 00:00,01-04-2017 00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,L1,19-09-1947 00:00,03-05-2017 00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,L1,03-03-1965 00:00,17-10-2017 00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [286]:
data_2 = pd.read_csv(r'D:\datasets\calaries data.csv')

In [287]:
data_2

    Duration        Date    Pulse  Maxpulse  Calories
0         60  '2020/12/01'    110       130     409.1
1         60  '2020/12/02'    117       145     479.0
2         60  '2020/12/03'    103       135     340.0
3         45  '2020/12/04'    109       175     282.4
4         45  '2020/12/05'    117       148     406.0
5         60  '2020/12/06'    102       127     300.0
6         60  '2020/12/07'    110       136     374.0
7        450  '2020/12/08'    104       134     253.3
8         30  '2020/12/09'    109       133     195.1
9         60  '2020/12/10'     98       124     269.0
10        60  '2020/12/11'    103       147     329.3
11        60  '2020/12/12'    100       120     250.7
12        60  '2020/12/12'    100       120     250.7
13        60  '2020/12/13'    106       128     345.3
14        60  '2020/12/14'    104       132     379.3
15        60  '2020/12/15'     98       123     275.0
16        60  '2020/12/16'     98       120     215.2
17        60  '2020/12/17'    100       120     300.0
18        45  '2020/12/18'     90       112       NaN
19        60  '2020/12/19'    103       123     323.0
20        45  '2020/12/20'     97       125     243.0
21        60  '2020/12/21'    108       131     364.2
22        45           NaN    100       119     282.0
23        60  '2020/12/23'    130       101     300.0
24        45  '2020/12/24'    105       132     246.0
25        60  '2020/12/25'    102       126     334.5
26        60    26-12-2020    100       120     250.0
27        60  '2020/12/27'     92       118     241.0
28        60  '2020/12/28'    103       132       NaN
29        60  '2020/12/29'    100       132     280.0
30        60  '2020/12/30'    102       129     380.3
31        60  '2020/12/31'     92       115     243.0

In [288]:
# head() : returns the top 5 rows of data

In [289]:
data_2.head()

   Duration        Date    Pulse  Maxpulse  Calories
0        60  '2020/12/01'    110       130     409.1
1        60  '2020/12/02'    117       145     479.0
2        60  '2020/12/03'    103       135     340.0
3        45  '2020/12/04'    109       175     282.4
4        45  '2020/12/05'    117       148     406.0

In [290]:
# tail() : returns the last 5 rows of data

In [291]:
data_2.tail()

    Duration        Date    Pulse  Maxpulse  Calories
27        60  '2020/12/27'     92       118     241.0
28        60  '2020/12/28'    103       132       NaN
29        60  '2020/12/29'    100       132     280.0
30        60  '2020/12/30'    102       129     380.3
31        60  '2020/12/31'     92       115     243.0

In [292]:
# describing the data
data_2.describe()

         Duration       Pulse    Maxpulse    Calories
count   32.000000   32.000000   32.000000   30.000000
mean    68.437500  103.500000  128.500000  304.680000
std     70.039591    7.832933   12.998759   66.003779
min     30.000000   90.000000  101.000000  195.100000
25%     60.000000  100.000000  120.000000  250.700000
50%     60.000000  102.500000  127.500000  291.200000
75%     60.000000  106.500000  132.250000  343.975000
max    450.000000  130.000000  175.000000  479.000000

In [293]:
data_2.count()

Duration    32
Date        31
Pulse       32
Maxpulse    32
Calories    30
dtype: int64

In [294]:
#create DataFrame
df = pd.DataFrame({'team': ['A', 'A', 'A', 'A', 'B', 'B', 'B', 'B'],
                   'points': [8, 8, 13, 13, 22, 22, 25, 29],
                   'assists': [5, 8, 7, 9, 12, 9, 9, 4],
                   'rebounds': [11, 8, 11, 6, 6, 5, 9, 12]})

In [295]:
df

  team  points  assists  rebounds
0    A       8        5        11
1    A       8        8         8
2    A      13        7        11
3    A      13        9         6
4    B      22       12         6
5    B      22        9         5
6    B      25        9         9
7    B      29        4        12

In [296]:
# nunique() : count unique value in each column

In [297]:
df.nunique()

team        2
points      5
assists     6
rebounds    6
dtype: int64

In [298]:
# nunique(axis = 1) : count unique values in each row

In [299]:
df.nunique(axis = 1)

0    4
1    2
2    4
3    4
4    4
5    4
6    3
7    4
dtype: int64

In [300]:
# groupby() : count unique values by group

In [301]:
df.groupby('team')['points'].nunique()

team
A    2
B    3
Name: points, dtype: int64

In [302]:
#create DataFrame with some missing values
df = pd.DataFrame({'a': [4, np.nan, np.nan, 7, 8, 12],
                   'b': [np.nan, 6, 8, 14, 29, np.nan],
                   'c': [11, 8, 10, 6, 6, 9]})

In [303]:
df

      a     b   c
0   4.0   NaN  11
1   NaN   6.0   8
2   NaN   8.0  10
3   7.0  14.0   6
4   8.0  29.0   6
5  12.0   NaN   9

In [270]:
# total count of missing values

In [271]:
df.isnull().sum()

a    2
b    2
c    0
dtype: int64

In [272]:
# drop rows with any missing values
df_dropped_row = df.dropna()

In [273]:
df_dropped_row

     a     b  c
3  7.0  14.0  6
4  8.0  29.0  6

In [274]:
# drop columns with any missing values
df_drop_col = df.dropna(axis = 1)

In [275]:
df_drop_col

    c
0  11
1   8
2  10
3   6
4   6
5   9

In [276]:
# filling missing values
df_filled_mean = df.fillna(df.mean())

In [277]:
df_filled_mean

       a      b   c
0   4.00  14.25  11
1   7.75   6.00   8
2   7.75   8.00  10
3   7.00  14.00   6
4   8.00  29.00   6
5  12.00  14.25   9

In [278]:
# filling missing value with median
df_filled_median = df.fillna(df.median())

In [279]:
df_filled_median

      a     b   c
0   4.0  11.0  11
1   7.5   6.0   8
2   7.5   8.0  10
3   7.0  14.0   6
4   8.0  29.0   6
5  12.0  11.0   9

In [207]:
# create a dataframe
raw_data = {'first_name': ['Sam', 'Ziva', 'Kia', 'Robin', 'Kim'], 
         'degree': ["MBA", "MS", "Graduate", "Arts", "MS"],
         'nationality': ["USA", "India", "UK", "France", "Canada"],
         'age': [25, 29, 19, 21, 33],
         'grade':['A+',  'A', 'C', np.nan, 'B-']}

In [208]:
df = pd.DataFrame(raw_data, columns = ['first_name', 'degree','nationality',
         'age','grade'])

In [209]:
df

  first_name    degree nationality  age grade
0        Sam       MBA         USA   25    A+
1       Ziva        MS       India   29     A
2        Kia  Graduate          UK   19     C
3      Robin      Arts      France   21   NaN
4        Kim        MS      Canada   33    B-

In [210]:
# select rows or columns based on conditions in pandas dataframe using different operators

In [211]:
df[df['age']>28]

  first_name degree nationality  age grade
1       Ziva     MS       India   29     A
4        Kim     MS      Canada   33    B-

In [215]:
# select all cases where age is greater than 28 and grade is 'A'
df[(df['age'] > 28) & (df['grade'] == 'A')]

  first_name degree nationality  age grade
1       Ziva     MS       India   29     A

In [216]:
# select data using loc()
# select rows where age is greater than 28
df.loc[df['age'] > 28]

  first_name degree nationality  age grade
1       Ziva     MS       India   29     A
4        Kim     MS      Canada   33    B-

In [217]:
# select data using "iloc"
# a. single selection
# rows 
df.iloc[0]

first_name     Sam
degree         MBA
nationality    USA
age             25
grade           A+
Name: 0, dtype: object

In [218]:
df.iloc[-1]

first_name        Kim
degree             MS
nationality    Canada
age                33
grade              B-
Name: 4, dtype: object

In [219]:
# columns
df.iloc[:, 0]

0      Sam
1     Ziva
2      Kia
3    Robin
4      Kim
Name: first_name, dtype: object

In [220]:
df.iloc[:, -1]

0     A+
1      A
2      C
3    NaN
4     B-
Name: grade, dtype: object

In [226]:
# multiple selection
# first three rows of dataframe
df.iloc[0:3]

  first_name    degree nationality  age grade
0        Sam       MBA         USA   25    A+
1       Ziva        MS       India   29     A
2        Kia  Graduate          UK   19     C

In [227]:
# first two columns of data frame with all rows
df.iloc[:, 0:2]

  first_name    degree
0        Sam       MBA
1       Ziva        MS
2        Kia  Graduate
3      Robin      Arts
4        Kim        MS

In [228]:
# 1st, 4th row and 1st, 3rd columns
df.iloc[[0,3], [0,2]]

  first_name nationality
0        Sam         USA
3      Robin      France

In [229]:
# first 2 rows and 2nd, 3rd, 4th columns of data frame (degree-age).
df.iloc[0:2, 1:4]

  degree nationality  age
0    MBA         USA   25
1     MS       India   29

In [232]:
# create a sample dataframe
data = {'Name' : ['ziva', 'kia', 'robin'],
       'Age' : [29, 19, 21] }
df = pd.DataFrame(data)

In [233]:
df

    Name  Age
0   ziva   29
1    kia   19
2  robin   21

In [234]:
# adding a new column 'salary'
df['salary'] = [50000, 60000, 70000]

In [235]:
df

    Name  Age  salary
0   ziva   29   50000
1    kia   19   60000
2  robin   21   70000

In [236]:
# remove the salary column
df = df.drop(columns = ['salary'])

In [237]:
df

    Name  Age
0   ziva   29
1    kia   19
2  robin   21

In [238]:
# updating columns
# update the "Age" column for kia
df.loc[df['Name']== 'kia', 'Age'] = 31

In [239]:
df

    Name  Age
0   ziva   29
1    kia   31
2  robin   21

In [240]:
# removing the inndex column
df = df.reset_index(drop = True)

In [241]:
df

    Name  Age
0   ziva   29
1    kia   31
2  robin   21

In [242]:
d = pd.DataFrame({'foo': [True, True, False], 'bar': [True, False, False]})

In [243]:
d

     foo    bar
0   True   True
1   True  False
2  False  False

In [244]:
# add the 'foo' and 'bar' columns
d['sum'] = d['foo'] + d['bar']

In [245]:
d

     foo    bar    sum
0   True   True   True
1   True  False   True
2  False  False  False

In [247]:
d['difference'] = d['foo'] - d['bar']

TypeError: numpy boolean subtract, the `-` operator, is not supported, use the bitwise_xor, the `^` operator, or the logical_xor function instead.

In [248]:
# multiplication
d['product'] = d['foo'] * d['bar']

In [249]:
d

     foo    bar    sum  product
0   True   True   True     True
1   True  False   True    False
2  False  False  False    False

In [254]:
# Create a new column with logical OR result
d['logical_or'] =d['foo'] | d['bar']

In [255]:
d

     foo    bar    sum  product  logical_or  logical_and
0   True   True   True     True        True         True
1   True  False   True    False        True        False
2  False  False  False    False       False        False

In [256]:
# Create a new column with logical AND result
d['logical_and'] = d['foo'] & d['bar']

In [257]:
d

     foo    bar    sum  product  logical_or  logical_and
0   True   True   True     True        True         True
1   True  False   True    False        True        False
2  False  False  False    False       False        False